{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 1], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_10", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "name": "conv2d_11", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_7", "units": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "rate": 0.5, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_8", "units": 8, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}]}